; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v5 ?v8)
             (pred_9 ?v12 ?v1)
             (pred_7 ?v5 ?v1)
             (pred_8 ?v9 ?v5 )
	     (pred_2 ?v5)
             (pred_12 ?v6)
             (pred_6 ?v12)
             (pred_4 ?v1)
             (pred_1 ?v5)
             (pred_5 ?v12)
             (pred_3 ?v5)
             (pred_10 ))



(:action op_2
:parameters (?v2 ?v3 ?v4 ?v13)
:precondition (and (pred_12 ?v2) (pred_12 ?v3) (pred_6 ?v4) (pred_4 ?v13)
          (pred_11 ?v2 ?v3) (pred_9 ?v4 ?v13)
                   (pred_7 ?v3 ?v13) (pred_2 ?v2) 
                   (pred_1 ?v3) (pred_5 ?v4))
:effect (and  (pred_3 ?v3) (not (pred_1 ?v3))))


(:action op_4
:parameters (?v2 ?v11)
:precondition (and (pred_12 ?v2) (pred_12 ?v11)
               (pred_2 ?v2) (pred_11 ?v2 ?v11) (pred_3 ?v11))
:effect (and (pred_2 ?v11) (not (pred_2 ?v2))))

(:action op_5
:parameters (?v2 ?v4)
:precondition (and (pred_12 ?v2) (pred_6 ?v4) 
                  (pred_2 ?v2) (pred_8 ?v4 ?v2) (pred_10 ))
:effect (and (pred_5 ?v4)
   (not (pred_8 ?v4 ?v2)) (not (pred_10 ))))


(:action op_3
:parameters (?v2 ?v10 ?v7)
:precondition (and (pred_12 ?v2) (pred_6 ?v10) (pred_6 ?v7)
                  (pred_2 ?v2) (pred_5 ?v7) (pred_8 ?v10 ?v2))
:effect (and (pred_5 ?v10) (pred_8 ?v7 ?v2)
        (not (pred_5 ?v7)) (not (pred_8 ?v10 ?v2))))

(:action op_1
:parameters (?v2 ?v4)
:precondition (and (pred_12 ?v2) (pred_6 ?v4) 
                  (pred_2 ?v2) (pred_5 ?v4))
:effect (and (pred_10 ) (pred_8 ?v4 ?v2) (not (pred_5 ?v4)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_27 obj_02 obj_19 obj_07 obj_06 obj_23 obj_31 obj_14 obj_21 obj_10 obj_03 obj_18 obj_29 obj_25 obj_12 obj_32 obj_04 obj_28 obj_08 obj_20 obj_01 obj_30 obj_13 obj_05 obj_22
    obj_15 obj_16 obj_26
    obj_24 obj_17 obj_11 obj_09
    )

    (:init
       (pred_10)

       (pred_12 obj_27)
       (pred_12 obj_02)
       (pred_12 obj_19)
       (pred_12 obj_07)
       (pred_12 obj_06)
       (pred_12 obj_23)
       (pred_12 obj_31)
       (pred_12 obj_14)
       (pred_12 obj_21)
       (pred_12 obj_10)
       (pred_12 obj_03)
       (pred_12 obj_18)
       (pred_12 obj_29)
       (pred_12 obj_25)
       (pred_12 obj_12)
       (pred_12 obj_32)
       (pred_12 obj_04)
       (pred_12 obj_28)
       (pred_12 obj_08)
       (pred_12 obj_20)
       (pred_12 obj_01)
       (pred_12 obj_30)
       (pred_12 obj_13)
       (pred_12 obj_05)
       (pred_12 obj_22)
       (pred_4 obj_15)
       (pred_4 obj_16)
       (pred_4 obj_26)
       (pred_6 obj_24)
       (pred_6 obj_17)
       (pred_6 obj_11)
       (pred_6 obj_09)

       (pred_11 obj_27 obj_23)
       (pred_11 obj_27 obj_02)
       (pred_11 obj_02 obj_31)
       (pred_11 obj_02 obj_19)
       (pred_11 obj_02 obj_27)
       (pred_11 obj_19 obj_14)
       (pred_11 obj_19 obj_07)
       (pred_11 obj_19 obj_02)
       (pred_11 obj_07 obj_21)
       (pred_11 obj_07 obj_06)
       (pred_11 obj_07 obj_19)
       (pred_11 obj_06 obj_10)
       (pred_11 obj_06 obj_07)
       (pred_11 obj_23 obj_03)
       (pred_11 obj_23 obj_31)
       (pred_11 obj_23 obj_27)
       (pred_11 obj_31 obj_18)
       (pred_11 obj_31 obj_14)
       (pred_11 obj_31 obj_02)
       (pred_11 obj_31 obj_23)
       (pred_11 obj_14 obj_29)
       (pred_11 obj_14 obj_21)
       (pred_11 obj_14 obj_19)
       (pred_11 obj_14 obj_31)
       (pred_11 obj_21 obj_25)
       (pred_11 obj_21 obj_10)
       (pred_11 obj_21 obj_07)
       (pred_11 obj_21 obj_14)
       (pred_11 obj_10 obj_12)
       (pred_11 obj_10 obj_06)
       (pred_11 obj_10 obj_21)
       (pred_11 obj_03 obj_32)
       (pred_11 obj_03 obj_18)
       (pred_11 obj_03 obj_23)
       (pred_11 obj_18 obj_04)
       (pred_11 obj_18 obj_29)
       (pred_11 obj_18 obj_31)
       (pred_11 obj_18 obj_03)
       (pred_11 obj_29 obj_28)
       (pred_11 obj_29 obj_25)
       (pred_11 obj_29 obj_14)
       (pred_11 obj_29 obj_18)
       (pred_11 obj_25 obj_08)
       (pred_11 obj_25 obj_12)
       (pred_11 obj_25 obj_21)
       (pred_11 obj_25 obj_29)
       (pred_11 obj_12 obj_20)
       (pred_11 obj_12 obj_10)
       (pred_11 obj_12 obj_25)
       (pred_11 obj_32 obj_01)
       (pred_11 obj_32 obj_04)
       (pred_11 obj_32 obj_03)
       (pred_11 obj_04 obj_30)
       (pred_11 obj_04 obj_28)
       (pred_11 obj_04 obj_18)
       (pred_11 obj_04 obj_32)
       (pred_11 obj_28 obj_13)
       (pred_11 obj_28 obj_08)
       (pred_11 obj_28 obj_29)
       (pred_11 obj_28 obj_04)
       (pred_11 obj_08 obj_05)
       (pred_11 obj_08 obj_20)
       (pred_11 obj_08 obj_25)
       (pred_11 obj_08 obj_28)
       (pred_11 obj_20 obj_22)
       (pred_11 obj_20 obj_12)
       (pred_11 obj_20 obj_08)
       (pred_11 obj_01 obj_30)
       (pred_11 obj_01 obj_32)
       (pred_11 obj_30 obj_13)
       (pred_11 obj_30 obj_04)
       (pred_11 obj_30 obj_01)
       (pred_11 obj_13 obj_05)
       (pred_11 obj_13 obj_28)
       (pred_11 obj_13 obj_30)
       (pred_11 obj_05 obj_22)
       (pred_11 obj_05 obj_08)
       (pred_11 obj_05 obj_13)
       (pred_11 obj_22 obj_20)
       (pred_11 obj_22 obj_05)
       (pred_1 obj_07)
       (pred_1 obj_02)
       (pred_1 obj_04)
       (pred_1 obj_13)
       (pred_7  obj_07 obj_15)
       (pred_7  obj_02 obj_16)
       (pred_7  obj_04 obj_26)
       (pred_7  obj_13 obj_15)
       (pred_3 obj_27)
       (pred_3 obj_19)
       (pred_3 obj_06)
       (pred_3 obj_23)
       (pred_3 obj_31)
       (pred_3 obj_14)
       (pred_3 obj_21)
       (pred_3 obj_10)
       (pred_3 obj_03)
       (pred_3 obj_18)
       (pred_3 obj_29)
       (pred_3 obj_25)
       (pred_3 obj_12)
       (pred_3 obj_32)
       (pred_3 obj_28)
       (pred_3 obj_08)
       (pred_3 obj_20)
       (pred_3 obj_01)
       (pred_3 obj_30)
       (pred_3 obj_05)
       (pred_3 obj_22)

       (pred_9  obj_24 obj_15)
       (pred_9  obj_17 obj_16)
       (pred_9  obj_11 obj_26)
       (pred_9  obj_09 obj_15)
       (pred_8 obj_24 obj_18)
       (pred_8 obj_17 obj_10)
       (pred_8 obj_11 obj_18)
       (pred_8 obj_09 obj_32)
       (pred_2 obj_21)
    )

    (:goal (and
       (pred_8 obj_24 obj_12)
       (pred_8 obj_11 obj_25)
    ))
(:constraints
  (always (not (pred_2 obj_29)))
)
)

; plan
1. (op_4 obj_21 obj_14)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_14)
   goals met: 0 of 2
2. (op_4 obj_14 obj_31)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_31)
   goals met: 0 of 2
3. (op_4 obj_31 obj_18)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_18)
   goals met: 0 of 2
4. (op_5 obj_18 obj_11)
   deleted: (pred_8 obj_11 obj_18) (pred_10)
   added: (pred_5 obj_11)
   goals met: 0 of 2
5. (op_2 obj_18 obj_04 obj_11 obj_26)
   deleted: (pred_1 obj_04)
   added: (pred_3 obj_04)
   goals met: 0 of 2
6. (op_4 obj_18 obj_04)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_04)
   goals met: 0 of 2
7. (op_4 obj_04 obj_28)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_28)
   goals met: 0 of 2
8. (op_4 obj_28 obj_08)
   deleted: (pred_2 obj_28)
   added: (pred_2 obj_08)
   goals met: 0 of 2
9. (op_4 obj_08 obj_25)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_25)
   goals met: 0 of 2
10. (op_1 obj_25 obj_11)
   deleted: (pred_5 obj_11)
   added: (pred_10) (pred_8 obj_11 obj_25)
   goals met: 1 of 2
11. (op_4 obj_25 obj_08)
   deleted: (pred_2 obj_25)
   added: (pred_2 obj_08)
   goals met: 1 of 2
12. (op_4 obj_08 obj_28)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_28)
   goals met: 1 of 2
13. (op_4 obj_28 obj_04)
   deleted: (pred_2 obj_28)
   added: (pred_2 obj_04)
   goals met: 1 of 2
14. (op_4 obj_04 obj_18)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_18)
   goals met: 1 of 2
15. (op_5 obj_18 obj_24)
   deleted: (pred_8 obj_24 obj_18) (pred_10)
   added: (pred_5 obj_24)
   goals met: 1 of 2
16. (op_4 obj_18 obj_31)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_31)
   goals met: 1 of 2
17. (op_4 obj_31 obj_14)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_14)
   goals met: 1 of 2
18. (op_4 obj_14 obj_21)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_21)
   goals met: 1 of 2
19. (op_4 obj_21 obj_10)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_10)
   goals met: 1 of 2
20. (op_4 obj_10 obj_12)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_12)
   goals met: 1 of 2
21. (op_1 obj_12 obj_24)
   deleted: (pred_5 obj_24)
   added: (pred_10) (pred_8 obj_24 obj_12)
   goals met: 2 of 2
